# Global-Legal-AI
# خلي ملف html في الواجهه اولى ولا تضعه داخل الملف لكي يتم المشروع لعرض الواجهه لانا الواجهه لاتهر واريد واجه انيقه للمشروع واريدك أن تصلح كل الأخطاء وان تفعل كل ما هوا مناسب 

from flask import Flask, jsonify
app = Flask(__name__)

@app.route('/')
def home():
    return 'Global-Legal-AI - خلي ملف html في الواجهه اولى ولا تضعه داخل الملف لكي يتم المشروع لعرض الواجهه لانا الواجهه لاتهر واريد واجه انيقه للمشروع واريدك أن تصلح كل الأخطاء وان تفعل كل ما هوا مناسب '

@app.route('/api/test')
def test():
    return jsonify({
        "status": "success",
        "task": "خلي ملف html في الواجهه اولى ولا تضعه داخل الملف لكي يتم المشروع لعرض الواجهه لانا الواجهه لاتهر واريد واجه انيقه للمشروع واريدك أن تصلح كل الأخطاء وان تفعل كل ما هوا مناسب "
    })

if __name__ == '__main__':
    app.run(debug=True)
